Repository: biruk-77/abayequb
Catalog: lib/l10n/app_*.arb
Languages: am

# appName
source: Abay eQub
am: አባይ እቁብ

source: Welcome
am: እንኳን ደህና መጡ

source: Total Balance
am: ጠቅላላ ቀሪ ሂሳብ

source: CONTRIBUTE
am: ገቢ ያድርጉ

source: Select Package
am: የእቁብ አይነት ይምረጡ

# chooseGroup
source: Choose Group Type
am: የቡድን አይነት ይምረጡ

source: Join Group
am: እቁብ ይቀላቀሉ

source: Payment
am: ክፍያ

source: Confirm Payment
am: ክፍያ ያረጋግጡ

source: Success
am: ተሳክቷል

source: Error
am: ስህተት

source: Locked
am: የተቆለፈ

source: Login
am: ይግቡ

source: Register
am: ይመዝገቡ

# phone
source: Phone Number
am: የስልክ ቁጥር

source: Password
am: የይለፍ ቃል

source: Full Name
am: ሙሉ ስም

# email
source: Email Address
am: ኢሜይል አድራሻ

source: Send OTP
am: የማረጋገጫ ኮድ ላክ

source: Verify & Login
am: አረጋግጥና ግባ

source: OTP Sent
am: የማረጋገጫ ኮድ ተልኳል

# dontHaveAccount
source: Don't have an account?
am: መለያ የለዎትም?

# alreadyHaveAccount
source: Already have an account?
am: ቀድሞውኑ መለያ አለዎት?

source: Welcome Back
am: እንኳን ደህና መጡ

source: Join Abay eQub
am: አባይ እቁብን ይቀላቀሉ

# flowingWealth
source: Flowing Wealth, Shared Future
am: የሀብት ፍሰት፣ የጋራ የወደፊት

source: Home
am: መነሻ

source: History
am: ታሪክ

source: Profile
am: መገለጫ

# aboutAbay
source: About Abay eQub
am: ስለ አባይ እቁብ

source: Settings
am: ቅንብሮች

source: Logout
am: ይውጡ

# confirmLogout
source: Are you sure you want to logout?
am: በእርግጥ መውጣት ይፈልጋሉ?

source: Cancel
am: ይቅር

source: Available Balance
am: ጠቅላላ ቀሪ ሂሳብ

# lockedBalance
source: Locked: {amount} ETB
am: የተቆለፈ: {amount} ብር

source: See All
am: ሁሉንም እይ

source: Language
am: ቋንቋ

source: Theme
am: ገጽታ

source: Light
am: ብርሃን

source: Dark
am: ጨለማ

source: System
am: የስርዓቱ

source: Your Active eQubs
am: የእርስዎ ንቁ እቁቦች

source: Explore Packages
am: እቁቦችን ያስሱ

source: Next Contribution
am: የሚቀጥለው ክፍያ

source: Next Payout
am: የሚቀጥለው ክፍያ

source: Join
am: ይቀላቀሉ

source: Joining...
am: በመቀላቀል ላይ...

# joinedSuccess
source: Successfully joined group
am: ቡድኑን በተሳካ ሁኔታ ተቀላቅለዋል

# joinFailed
source: Failed to join group
am: ቡድኑን መቀላቀል አልተቻለም

# walletRequired
source: Wallet setup required
am: የኪስ ቦርሳ ማዘጋጀት ያስፈልጋል

# alreadyMember
source: Already a member of this group
am: ቀድሞውኑ የዚህ ቡድን አባል ነዎት

# joinGroupConfirmation
source: Are you sure you want to join
am: በእርግጥ መቀላቀል ይፈልጋሉ
